{
  "backend/main.mo": "Main Motoko canister implementing access control initialization, admin management, user profiles, and contact form/ticket handling.",
  "backend/migration.mo": "Simple migration module that upgrades old state to include an empty adminIds set.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for documentation or build tooling.",
  "frontend/index.css": "Global Tailwind-based style definitions including color variables, theming, and base element styling.",
  "frontend/index.html": "HTML entry point containing the root mount element and script loader for the frontend app.",
  "frontend/src/App.tsx": "Root React component wiring together layout sections and admin gate context.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component showing different messages and actions for unauthenticated or unauthorized admin access.",
  "frontend/src/components/AdminOrderManagementSection.tsx": "Admin dashboard handling orders, admin checks, initialization flows, and sub-sections for tracking, quotes, and admin principal management.",
  "frontend/src/components/AdminOrderTrackingSection.tsx": "Admin interface for searching tracking codes and updating package arrival, restoration steps, and shipping status.",
  "frontend/src/components/AdminPasswordPromptModal.tsx": "Modal prompting for an admin password and unlocking the admin panel upon correct entry.",
  "frontend/src/components/AdminPrincipalManagementSection.tsx": "Admin tool to add new admin principals and display the current list of authorized principals.",
  "frontend/src/components/AdminQuoteFormsSection.tsx": "Displays submitted quote tickets and allows admins to toggle each ticket’s completion status.",
  "frontend/src/components/ContactFormSection.tsx": "Customer quote request form that validates input, submits data, and shows a success message.",
  "frontend/src/components/HeroSection.tsx": "Hero banner with background image, marketing text, and buttons to scroll to contact and tracking sections.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with error handling and UI state for authentication.",
  "frontend/src/components/ServiceTiersSection.tsx": "Renders three service tier cards with features and a scroll action for contacting the service.",
  "frontend/src/components/SiteFooter.tsx": "Displays the site footer with branding, navigation links, social icons, and admin access handling.",
  "frontend/src/components/SiteHeader.tsx": "Implements a sticky header with navigation, mobile menu, admin link behavior, and the login button.",
  "frontend/src/components/TrackPackageSection.tsx": "Provides a tracking form that fetches package status, displays progress, and shows status badges.",
  "frontend/src/context/AdminGateContext.tsx": "Defines context for admin access gating with unlock prompts and state management.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminActor.ts": "Creates an admin-capable backend actor using the authenticated identity without secret initialization.",
  "frontend/src/hooks/useAdminAllowlistQueries.ts": "Exposes queries and mutations for reading and modifying the admin allowlist using the admin actor.",
  "frontend/src/hooks/useAdminDiagnostics.ts": "Provides a React Query hook to fetch admin initialization status from the admin actor.",
  "frontend/src/hooks/useAdminOrderQueries.ts": "Contains React Query hooks for creating orders, updating order status, listing all orders, checking admin status, and initializing access control.",
  "frontend/src/hooks/useAdminTicketQueries.ts": "Defines hooks to list all admin tickets and update their completion status with proper error handling.",
  "frontend/src/hooks/useAdminTrackingManagementQueries.ts": "Provides admin tracking management hooks for fetching tracking state and performing actions like marking arrival, adding steps, and completing steps.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for login, identity management, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exposes a mutation hook to submit contact form data through the actor and invalidate related queries.",
  "frontend/src/hooks/useTrackingQueries.ts": "Provides a mutation hook to fetch both tracking state and order status for a package with combined error handling.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, dark mode styles, typography, and utility classes including a logo container.",
  "frontend/src/lib/assetUrl.ts": "Utility to generate base-path-aware asset URLs respecting Vite’s BASE_URL.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the main App component.",
  "frontend/src/utils/orderStatusLabel.ts": "Maps OrderStatus enum values to human-readable status labels.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and remove them from the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, container settings, animations, and plugin integrations.",
  "project_state.json": "Describes project state, existing features, and pending requests related to multi-admin access control and Internet Identity."
}