{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, contact form tickets, and admin-only ticket updates with initialization logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten 1–2 sentence summaries for multiple frontend source files.",
  "frontend/index.css": "Defines Tailwind CSS base layers and OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app assembling all site sections and conditionally showing the admin panel based on unlock state.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable UI component showing access-denied messages with optional login or retry actions.",
  "frontend/src/components/AdminOrderManagementSection.tsx": "Admin panel for creating and managing orders, initializing access control, and enforcing admin permissions.",
  "frontend/src/components/AdminOrderTrackingSection.tsx": "Admin interface for searching tracking codes and updating restoration steps and shipping status.",
  "frontend/src/components/AdminPasswordPromptModal.tsx": "Modal that prompts for a hardcoded admin password and unlocks the admin section with scroll behavior on success.",
  "frontend/src/components/AdminQuoteFormsSection.tsx": "Displays and manages submitted quote tickets, including loading states, error handling, and toggling ticket completion status.",
  "frontend/src/components/ContactFormSection.tsx": "Customer contact/quote form with validation and submission, showing success messages and using a mutation to send data.",
  "frontend/src/components/HeroSection.tsx": "Hero banner with background image, headline, feature highlights, and buttons that scroll to contact and tracking sections.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity, handling authentication state, errors, and clearing cached queries.",
  "frontend/src/components/ServiceTiersSection.tsx": "Shows three service tier cards with pricing and features, including a 'Most Popular' tier and a button that scrolls to the contact section.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with branding, quick navigation buttons, social links, and admin-gated access behavior.",
  "frontend/src/components/SiteHeader.tsx": "Header with brand logo, responsive navigation, scroll-based styling, and admin-gated navigation handling.",
  "frontend/src/components/TrackPackageSection.tsx": "Order tracking UI that accepts a tracking code, displays progress and status, and handles tracking queries.",
  "frontend/src/context/AdminGateContext.tsx": "Context provider managing admin unlock state, prompt visibility, and related actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminActor.ts": "Provides an admin-capable actor using authenticated identity without secret initialization.",
  "frontend/src/hooks/useAdminDiagnostics.ts": "Fetches backend initialization status using the admin actor.",
  "frontend/src/hooks/useAdminOrderQueries.ts": "Admin hooks for creating, updating, listing, and checking admin privileges for orders.",
  "frontend/src/hooks/useAdminTicketQueries.ts": "Admin hooks for listing tickets and updating ticket completion status.",
  "frontend/src/hooks/useAdminTrackingManagementQueries.ts": "Provides React Query hooks for admins to fetch tracking state and mutate package status or restoration steps, with error handling and cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context provider and hook for managing login, identity persistence, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook to submit a contact form via an actor and invalidate related queries.",
  "frontend/src/hooks/useTrackingQueries.ts": "Adds a mutation hook that fetches tracking state and order status, handling missing codes and errors.",
  "frontend/src/index.css": "Sets Tailwind base styles, theme variables, dark mode styles, and custom utilities including a square logo container.",
  "frontend/src/lib/assetUrl.ts": "Builds asset URLs that respect the app’s base path by normalizing the base URL and input path.",
  "frontend/src/main.tsx": "Bootstraps the app by rendering it with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, clearing, and manipulating URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, existing features, and new feature requests for an admin-gated application with quote request visibility. Includes architectural notes on password gating and secure authentication."
}