{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and a contact ticket system with auto-initialized admin and permissions enforcement.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend source files for reference or tooling.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color variables, theming, and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML entry point setting up the root div and loading the main TypeScript React bundle.",
  "frontend/src/App.tsx": "Top-level React component assembling the site's main sections including header, hero, services, contact, tracking, admin, and footer.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable UI showing an access denied message with alert styling for non‑admin users.",
  "frontend/src/components/AdminOrderManagementSection.tsx": "Admin-only interface for creating orders, updating statuses, and listing all orders with permission checks and loading states.",
  "frontend/src/components/ContactFormSection.tsx": "Contact form component with validation, async submission, success message handling, and integration with backend mutation hook.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, headline, CTAs, and scroll-to-section handlers.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that triggers Internet Identity login/logout and shows status states.",
  "frontend/src/components/ServiceTiersSection.tsx": "Displays service tier cards with pricing, features, and a button that scrolls to the contact section.",
  "frontend/src/components/SiteFooter.tsx": "Footer with branding, quick‑link navigation using scroll, and social media links.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with navigation, mobile menu, admin link logic, and scroll-to-section behavior.",
  "frontend/src/components/TrackPackageSection.tsx": "Order tracking form that queries tracking data, displays progress, status badges, and step details.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on authentication state and refreshes dependent queries.",
  "frontend/src/hooks/useAdminOrderQueries.ts": "Provides React Query hooks for creating, updating, and retrieving orders and checking admin status through the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook for managing identities, login state, and logout via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook for submitting contact form data through the actor API and invalidating related queries.",
  "frontend/src/hooks/useTrackingQueries.ts": "Exposes a mutation hook to fetch tracking state and optional order status, handling not-found and error cases.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for light/dark themes with additional utilities and layout rules.",
  "frontend/src/lib/assetUrl.ts": "Builds base-path-aware URLs for static assets using the app’s configured BASE_URL.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and mounts it to the DOM.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, theme extensions, custom colors, fonts, and utility plugins.",
  "project_state.json": "Metadata describing project state, features, and pending requests focused on auto-granting admin access via Internet Identity."
}