{
  "backend/main.mo": "Motoko canister storing contact-form tickets keyed by email with functions to submit, update status, query completion, and modify categories.",
  "feature_evidence.json": "Feature evidence report describing a requirement to place a specific logo image into the frontend static assets path.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files explaining their roles in the React app and styling system.",
  "frontend/index.css": "Tailwind base and theme variable definitions establishing OKLCH color tokens and dark-mode variants.",
  "frontend/index.html": "Root HTML page mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Top-level React component composing the header, hero, service tiers, contact form, and footer.",
  "frontend/src/components/ContactFormSection.tsx": "Contact form component handling validation, submission to the backend, and success messaging.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, headline, CTAs, and smooth-scroll handlers to contact and services sections.",
  "frontend/src/components/ServiceTiersSection.tsx": "Displays three pricing tiers with details and a CTA button that scrolls to the contact form.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with brand info, quick-scroll navigation buttons, and social media icon links.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with scroll detection, desktop/mobile navigation, and smooth section scrolling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity; invalidates related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation to submit the contact form through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables using OKLCH colors, plus utilities for typography and logo display.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing the current issue and required logo asset placement for correct display."
}