{
  "backend/main.mo": "Motoko canister implementing access control, admin management, user profiles, and ticket/contact-form storage with initialization logic.",
  "feature_evidence.json": "Feature evidence report describing the requirement to make long admin-panel ticket messages fully viewable via a modal or drawer.",
  "frontend-file-summaries.txt": "Prewritten summaries mapping frontend file paths to short descriptions of their components and behavior.",
  "frontend/index.css": "Tailwind base and theme configuration defining OKLCH color tokens, dark mode values, and global style rules.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Top-level React app composing all sections, admin gate logic, and the password modal.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI card shown when a user lacks admin permissions, offering login or retry actions.",
  "frontend/src/components/AdminOrderManagementSection.tsx": "Admin dashboard handling order creation, status updates, access-control initialization, and sub‑sections for quotes, tracking, and principals.",
  "frontend/src/components/AdminOrderTrackingSection.tsx": "Admin tool for searching tracking codes and managing arrival, restoration steps, and shipping status.",
  "frontend/src/components/AdminPasswordPromptModal.tsx": "Modal prompting for an admin password and unlocking the admin section with success scroll behavior and error handling.",
  "frontend/src/components/AdminPrincipalManagementSection.tsx": "Admin UI for adding principals to the allowlist and listing current admin principals with loading and error states.",
  "frontend/src/components/AdminQuoteFormsSection.tsx": "Displays all submitted quote tickets, supports viewing full messages and toggling completion status with mutation handling.",
  "frontend/src/components/ContactFormSection.tsx": "Public contact form allowing users to submit quote requests with validation, mutation submission, and success alert.",
  "frontend/src/components/FullTicketMessageModal.tsx": "Modal showing a ticket’s full message details including name, email, category, and content with scrollable layout.",
  "frontend/src/components/HeroSection.tsx": "Landing page hero section with background image, headline, CTAs, and scroll-to-section functionality.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button that manages Internet Identity authentication state and handles login, logout, and error cases.",
  "frontend/src/components/ServiceTiersSection.tsx": "UI section rendering three service tiers with pricing, features, and a scroll-to-contact action.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with branding, navigation links, social media, and admin-gated access logic.",
  "frontend/src/components/SiteHeader.tsx": "Sticky header with scroll-aware styling, navigation links, mobile menu, and admin-gated access.",
  "frontend/src/components/TrackPackageSection.tsx": "Package tracking form that queries backend tracking data and displays progress, status badges, and timestamps.",
  "frontend/src/context/AdminGateContext.tsx": "Context managing admin-gate state including unlock prompts and access control helpers.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor tied to identity with secret-based access initialization.",
  "frontend/src/hooks/useAdminActor.ts": "Hook creating an authenticated admin-capable actor without secret initialization and caching it.",
  "frontend/src/hooks/useAdminAllowlistQueries.ts": "Hooks for querying and mutating the admin allowlist, including validation and permission error handling.",
  "frontend/src/hooks/useAdminDiagnostics.ts": "Hook fetching backend initialization diagnostics for admin users.",
  "frontend/src/hooks/useAdminOrderQueries.ts": "Provides React Query hooks for admins to create orders, update order status, list all orders, check admin rights, and initialize access control.",
  "frontend/src/hooks/useAdminTicketQueries.ts": "Defines admin hooks to list all tickets and update ticket status with error handling and cache invalidation.",
  "frontend/src/hooks/useAdminTrackingManagementQueries.ts": "Implements admin tracking hooks to fetch tracking state and manage package arrival and restoration steps.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for managing authentication, login state, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Contains a hook to submit a contact form using an actor and invalidate related queries.",
  "frontend/src/hooks/useTrackingQueries.ts": "Adds a hook to retrieve tracking state and order status for a package with combined error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode settings, and utility classes including logo styling.",
  "frontend/src/lib/assetUrl.ts": "Utility to build BASE_URL-aware asset URLs by normalizing base and path formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/utils/orderStatusLabel.ts": "Maps OrderStatus enum values to human-readable status labels.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), store/retrieve them in sessionStorage, and persist or clear them as needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and extended theme options.",
  "project_state.json": "Stores project metadata, feature requests, issues, and state for the admin panel enhancement regarding full message viewing."
}