{
  "backend/main.mo": "Actor implementing user profiles and a contact-ticket system with admin/user authorization, supporting profile CRUD and ticket submission and updates.",
  "feature_evidence.json": "Feature-evidence report mapping frontend tracking UI features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including components, hooks, styles, and assets.",
  "frontend/index.css": "Global Tailwind-based CSS defining color tokens, dark mode variables, and base styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component composing the page layout with header, sections, and footer.",
  "frontend/src/components/ContactFormSection.tsx": "Contact form component using React Hook Form and backend mutation for free quote submissions.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, headline, feature highlights, and smooth-scroll CTA buttons.",
  "frontend/src/components/ServiceTiersSection.tsx": "Renders a pricing section with three card restoration tiers and smooth-scroll contact button.",
  "frontend/src/components/SiteFooter.tsx": "Displays footer with brand info, navigation links, and social media icons with smooth-scroll behavior.",
  "frontend/src/components/SiteHeader.tsx": "Implements sticky header with scroll detection, desktop/mobile navigation, and smooth-scrolling links.",
  "frontend/src/components/TrackPackageSection.tsx": "Provides package tracking UI with user lookup and admin tools for updating tracking status and restoration steps.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login flow, and context provider for storing and accessing user identity.",
  "frontend/src/hooks/useQueries.ts": "Defines mutation for submitting contact form data through the backend actor and invalidates related queries on success.",
  "frontend/src/hooks/useTrackingAdmin.ts": "Provides React Query hooks for admin checks and for mutating tracking states including creation, arrival, restoration steps, and shipping.",
  "frontend/src/hooks/useTrackingQueries.ts": "Defines hooks to fetch and cache tracking state data and to trigger refetches for specific tracking codes.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode colors, and utility classes including logo and text helpers.",
  "frontend/src/lib/assetUrl.ts": "Builds asset URLs using BASE_URL to ensure correct paths when served from subdirectories.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radii, shadows, and enabling plugins for typography, animations, and container queries.",
  "project_state.json": "Describes the project state, features, and requirements for admin order tracking and status management."
}