{
  "backend/main.mo": "Motoko actor that stores contact form tickets in a map and provides methods to submit forms, update status, and modify categories.",
  "feature_evidence.json": "Feature evidence report listing implemented UI changes and the files associated with header and footer logo removals.",
  "frontend-file-summaries.txt": "Text listing short summaries of all frontend source files, including components, assets, hooks, and configuration.",
  "frontend/index.css": "Tailwind‑based global stylesheet defining OKLCH color variables and theming for light and dark modes.",
  "frontend/index.html": "HTML entry point providing the root element and loading the main React script.",
  "frontend/src/App.tsx": "Main React app component composing the header, hero, service tiers, contact form, and footer.",
  "frontend/src/components/ContactFormSection.tsx": "React contact form with validation, success state, and backend submission via React Query.",
  "frontend/src/components/HeroSection.tsx": "Hero section with background image, headline, feature icons, and smooth‑scroll CTA buttons.",
  "frontend/src/components/ServiceTiersSection.tsx": "Displays three service tiers with pricing, features, and a CTA that scrolls to the contact form.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with brand info, navigation scroll buttons, and social media links.",
  "frontend/src/components/SiteHeader.tsx": "Header with scrolling behavior, desktop and mobile navigation, and smooth section scrolling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and identity persistence via a React context.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook that submits contact form data through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables for light and dark modes plus layout utilities.",
  "frontend/src/lib/assetUrl.ts": "Generates base-path-aware URLs for static assets using environment BASE_URL.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, containers, animations, and theme variables.",
  "project_state.json": "Stores the project’s state, including schema version, feature definitions, pending requests, and metadata for removing header and footer logos."
}