{
  "kind": "build_request",
  "title": "Rename Track Package to Track Order and move tracking section below Free Quote",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Rename all user-facing UI text that currently says \"Track Package\" to instead say \"Track Order\", including navigation, hero CTA button, footer quick link, and the Track section headings/titles/descriptions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can you change track package to track order."
        ]
      },
      "acceptanceCriteria": [
        "Site header navigation label reads \"Track Order\" on desktop and mobile.",
        "Hero secondary CTA button reads \"Track Order\".",
        "Footer quick link reads \"Track Order\".",
        "Track section headline reads \"Track Your Order\" (and related card title/description copy is updated to use \"Order\" instead of \"Package\" where appropriate).",
        "No remaining visible instances of the exact phrase \"Track Package\" appear in the UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Reorder the homepage sections so that the Pricing section is immediately followed by the \"Get Your Free Quote\" / \"Request a Quote\" form section, and the Track Order section appears beneath the Free Quote section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also can you move it beneath the get your free quote. This is so that the request a quote form is right beneath the prices"
        ]
      },
      "acceptanceCriteria": [
        "On the rendered page, the section order is: Hero -> Pricing -> Get Your Free Quote (Request a Quote form) -> Track Order -> Footer.",
        "Clicking the header/footer \"Track Order\" navigation item still smooth-scrolls to the Track Order section after it has been moved.",
        "Clicking \"Get a Quote\" / \"Get a Free Quote\" still smooth-scrolls to the quote form section, which is now directly under Pricing."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui must not be edited (compose them instead).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT.frontend.immutablePaths."
  ],
  "nonGoals": [
    "Do not change backend tracking or contact-form behavior.",
    "Do not change pricing tiers or quote form fields/validation logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}