{
  "kind": "build_request",
  "title": "Add admin workflow to update tracked order status and document current status states",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an admin-only UI to update a tracked order’s status after a tracking code has been entered, using the existing backend admin methods (createTrackingState, markPackageArrived, addRestorationStep, completeRestorationStep, markShipped).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Can you add a way for me to update the track order status."
        ]
      },
      "acceptanceCriteria": [
        "When an admin user is authenticated (Internet Identity + admin token already supported by the app), the Track Order section shows an \"Admin: Update Order Status\" area.",
        "Admin can enter a tracking code and perform the following actions via backend calls: create tracking entry (requires restorationLevel), mark order received (arrived=true), add restoration step (description), complete a restoration step by index, mark shipped (shipped=true and shippingTimestamp set).",
        "If a non-admin user attempts any admin action, the UI prevents submission and/or displays an English error message returned from the backend (e.g., Unauthorized).",
        "After an admin action succeeds, the displayed tracking timeline refreshes to reflect the updated state without requiring a full page reload."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose the current set of possible tracking statuses in the Track Order UI as clear English labels that match the existing tracking model (arrived boolean, restoration steps list with completion states, shipped boolean).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "What are the current possible statuses once a tracking code has been put in?"
        ]
      },
      "acceptanceCriteria": [
        "The Track Order section includes a short, user-facing explanation of the statuses/states supported by the system: Order Received (Pending/Complete), Restoration Process (shows restoration level and step list with Pending/Complete per step), Shipped (Pending/Complete, with shipped date when available).",
        "The explanation is shown in English and does not reference internal field names like \"arrived\" or \"steps\".",
        "The explanation remains consistent with what is rendered in the current timeline UI."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any other immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Integrate with external shipping carrier APIs or automatically derive statuses from third-party tracking codes.",
    "Add non-Internet-Identity authentication methods.",
    "Add real-time updates (polling/websockets/push notifications)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}