{
  "kind": "build_request",
  "title": "Admin panel: allow viewing full quote form message text",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the admin panel Quote Forms table so long customer messages are fully viewable (not truncated). Keep the table compact, but provide an explicit interaction to read the entire message for any ticket (e.g., click the message cell or a \"View full\" action that opens a dialog/drawer showing the full text with preserved line breaks and scroll when needed).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When going through the admin panel to look at the quote forms, if the customer types a longer description it can not be seen. Can you make it to where the entire message can be seen?"
        ]
      },
      "acceptanceCriteria": [
        "In Quote Forms (frontend/src/components/AdminQuoteFormsSection.tsx), the message preview in the table is no longer the only way to access the content (currently truncated via `line-clamp-2`).",
        "For any ticket with a long `ticket.formData.message`, an admin can open a full-message view and read the entire text.",
        "The full-message view displays the exact message content, including new lines/paragraphs (no loss of whitespace meaning), and supports scrolling for very long messages.",
        "The existing \"Mark Complete / Mark Pending\" action continues to work as before, and the new message viewing interaction does not interfere with it."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (shadcn components must be composed, not edited).",
    "Keep all backend logic unchanged; this is a UI-only fix to the admin quote viewer."
  ],
  "nonGoals": [
    "Changing what customers submit in the quote form (validation, max length, fields).",
    "Changing ticket storage format or backend schema.",
    "Adding search/filter/export for quote forms."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}