{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Square, non-overlapping logo rendering in header and footer",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Ensure header and footer logos render in a true square, preserve aspect ratio, and never visually include/overlap navigation/tab UI while continuing to use the existing logo asset path.",
      "acceptanceCriteria": [
        "In the SiteHeader, the logo renders within a square box and preserves its aspect ratio (no horizontal/vertical stretching).",
        "In the SiteFooter, the logo renders within a square box and preserves its aspect ratio (no horizontal/vertical stretching).",
        "On common viewport widths (mobile and desktop), the navigation buttons do not overlap the logo, and no tab-like UI elements appear inside the logo area.",
        "The logo continues to load from the existing static path: /assets/generated/blaines-card-clinic-logo.dim_512x512.png."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a reusable logo wrapper utility/class (square box, overflow hidden, consistent sizing) to enforce square rendering and prevent any visual bleed; keep styling changes within existing global styling entry points."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Wrap the logo image in a dedicated square container (using the new shared class) and ensure layout spacing prevents any nav/tab elements from visually overlapping the logo area across breakpoints; continue using src=\"/assets/generated/blaines-card-clinic-logo.dim_512x512.png\"."
        },
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Wrap the logo image in the same dedicated square container (using the shared class) and keep the image object-fit behavior so it preserves aspect ratio; continue using src=\"/assets/generated/blaines-card-clinic-logo.dim_512x512.png\"."
        },
        {
          "path": "frontend/public/assets/generated/blaines-card-clinic-logo.dim_512x512.png",
          "operation": "modify",
          "description": "Replace the existing image content with the cropped/resized true-square version (same filename/path) so no extra padding or header-tab-like artifacts are present: frontend/public/assets/generated/blaines-card-clinic-logo.dim_512x512.png."
        }
      ]
    }
  ]
}