{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin panel: manage multiple accepted Internet Identity admin principals",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Add an admin-panel UI to list accepted admin principals and add a new admin principal.",
      "acceptanceCriteria": [
        "When viewing the admin panel as an admin, the UI shows the list of currently accepted admin principals.",
        "The UI provides an input to add a new principal and a button to submit.",
        "On success, the list refreshes to include the newly added principal.",
        "On error (e.g., caller not admin, invalid principal text), the UI shows a clear English error message and does not break the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminAllowlistQueries.ts",
          "operation": "create",
          "description": "Create React Query hooks for admin allowlist management using existing backend capabilities: fetch current admin principals (getAdminIds) and add a new admin principal (addAdminId). Include client-side principal text validation/parsing and map authorization/validation failures into clear English errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminPrincipalManagementSection.tsx",
          "operation": "create",
          "description": "Add an admin-only panel section that (1) displays the current admin principal list and (2) provides a form to add another principal. Use shadcn/ui primitives (Card, Table, Input, Button, Alert, etc.) for consistent UI and handle loading, empty state, success feedback, and error messaging without breaking the page. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminOrderManagementSection.tsx",
          "operation": "modify",
          "description": "Wire the new AdminPrincipalManagementSection into the existing admin panel as an additional tab (e.g., “Admin Access”). Update the TabsList grid column count accordingly and ensure this section is only reachable after the existing admin gate has confirmed the caller is an admin. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Clarify admin-gate access denied UX for unauthenticated vs authenticated-but-not-admin users with English copy.",
      "acceptanceCriteria": [
        "If the user is not authenticated, the access-denied state prompts the user to log in.",
        "If the user is authenticated but not an accepted admin, the access-denied state indicates they are authenticated but not authorized (accepted admin) and suggests contacting an admin to be added.",
        "Copy is in English and does not imply that “the first user to log in becomes admin” if the system now supports managing multiple accepted admins."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Update the AccessDeniedScreen messaging to explicitly differentiate: (a) not logged in (prompt to log in) vs (b) logged in but not an accepted admin (not authorized; suggest contacting an admin to be added). Remove any language implying the first login becomes admin. Keep copy English and action buttons aligned with the two states. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminOrderManagementSection.tsx",
          "operation": "modify",
          "description": "Ensure the admin access gate passes the correct state to AccessDeniedScreen so the UI reliably shows the right message for unauthenticated users vs authenticated non-admins, and that retry behavior remains available only for authenticated users. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}