{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin panel: view full quote form message text",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Keep Quote Forms table compact while adding a clear interaction to open a scrollable full-message view that preserves line breaks, without affecting ticket status actions.",
      "acceptanceCriteria": [
        "In Quote Forms (frontend/src/components/AdminQuoteFormsSection.tsx), the message preview in the table is no longer the only way to access the content (currently truncated via `line-clamp-2`).",
        "For any ticket with a long `ticket.formData.message`, an admin can open a full-message view and read the entire text.",
        "The full-message view displays the exact message content, including new lines/paragraphs (no loss of whitespace meaning), and supports scrolling for very long messages.",
        "The existing \"Mark Complete / Mark Pending\" action continues to work as before, and the new message viewing interaction does not interfere with it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FullTicketMessageModal.tsx",
          "operation": "create",
          "description": "Create a small, composed (non-shadcn-ui-folder) modal/dialog component that renders the selected ticket message with preserved whitespace/line breaks and an internal scroll region for long content; include close interactions (e.g., close button + overlay click + Esc)."
        },
        {
          "path": "frontend/src/components/AdminQuoteFormsSection.tsx",
          "operation": "modify",
          "description": "Add state to track the currently selected ticket/message, keep the table message cell compact (can remain line-clamped) but add an explicit \"View full\" interaction (button/link and/or clickable message cell) that opens FullTicketMessageModal; ensure the new interaction does not conflict with the existing Mark Complete/Mark Pending button behavior and click targets."
        }
      ]
    }
  ]
}